[Timeout] BlockStatement
connection.js:20:43
   },
 });
 app.use(cors());
-export async function connectToDatabase() {
-  try {
-    // Connect the client to the server
-    await client.connect();
-    // Send a ping to confirm a successful connection
-    await client.db("admin").command({ ping: 1 });
-    console.log("Pinged your deployment. You successfully connected to MongoDB!");
-  } catch (err) {
-    console.error("Error connecting to MongoDB");
-    throw err;
-  }
-
-  // Connect to the specific database
-  const db = client.db("Flight-Ticket-Booking-System");
-
-  return db;
-}
+export async function connectToDatabase() {}
 
 // Mongoose setup

[Timeout] BlockStatement
connection.js:21:7
 });
 app.use(cors());
 export async function connectToDatabase() {
-  try {
-    // Connect the client to the server
-    await client.connect();
-    // Send a ping to confirm a successful connection
-    await client.db("admin").command({ ping: 1 });
-    console.log("Pinged your deployment. You successfully connected to MongoDB!");
-  } catch (err) {
+  try {} catch (err) {
     console.error("Error connecting to MongoDB");
     throw err;

[Timeout] ObjectLiteral
connection.js:25:38
     // Connect the client to the server
     await client.connect();
     // Send a ping to confirm a successful connection
-    await client.db("admin").command({ ping: 1 });
+    await client.db("admin").command({});
     console.log("Pinged your deployment. You successfully connected to MongoDB!");
   } catch (err) {

[Timeout] StringLiteral
connection.js:26:17
     await client.connect();
     // Send a ping to confirm a successful connection
     await client.db("admin").command({ ping: 1 });
-    console.log("Pinged your deployment. You successfully connected to MongoDB!");
+    console.log("");
   } catch (err) {
     console.error("Error connecting to MongoDB");

[Timeout] BlockStatement
connection.js:27:17
     // Send a ping to confirm a successful connection
     await client.db("admin").command({ ping: 1 });
     console.log("Pinged your deployment. You successfully connected to MongoDB!");
-  } catch (err) {
-    console.error("Error connecting to MongoDB");
-    throw err;
-  }
+  } catch (err) {}
 
   // Connect to the specific database

[Timeout] BlockStatement
connection.js:39:44
 }
 
 // Mongoose setup
-export const connectMongoose = async () => {
-        try 
-        {
-            await mongoose.connect(String(uri));
-            console.log("Connected to MongoDB")
-
-        } 
-        catch (error) 
-        {
-
-          console.error("Error connecting to MongoDB");
-          throw(error)
-          
-        }
-        
-};
+export const connectMongoose = async () => {};
 
 mongoose.connection.on("Disconnected",()=>{console.log("Mongoose connection disconnected")})

[Timeout] BlockStatement
connection.js:41:9
 // Mongoose setup
 export const connectMongoose = async () => {
         try 
-        {
-            await mongoose.connect(String(uri));
-            console.log("Connected to MongoDB")
-
-        } 
+        {} 
         catch (error) 
         {

[Timeout] BlockStatement
connection.js:47:9
 
         } 
         catch (error) 
-        {
-
-          console.error("Error connecting to MongoDB");
-          throw(error)
-          
-        }
+        {}
         
 };

[Timeout] BlockStatement
connection.js:56:43
         
 };
 
-mongoose.connection.on("Disconnected",()=>{console.log("Mongoose connection disconnected")})
+mongoose.connection.on("Disconnected",()=>{})
 mongoose.connection.on("Connected",()=>{console.log("Mongoose connection established")})
 

[Timeout] BlockStatement
connection.js:57:40
 };
 
 mongoose.connection.on("Disconnected",()=>{console.log("Mongoose connection disconnected")})
-mongoose.connection.on("Connected",()=>{console.log("Mongoose connection established")})
+mongoose.connection.on("Connected",()=>{})
 
 // Initialize connections
