[Timeout] BlockStatement
Controllers/AuthController.js:9:9
 const JWT_SECRET = process.env.JWT_SECRET;
 
 export const signup = async (req, res) => {
-    try {
-        const { name, email, password } = req.body;
-        console.log(email);
-        console.log('bbb')
-        const user = await UserModel.findOne({ email });
-        if (user) {
-            return res.status(409)
-                .json({ message: 'User already exist, you can login', success: false });
-        }
-        const userModel = new UserModel({ name, email, password });
-        userModel.password = await bcrypt.hash(password, 10);
-       
-        await userModel.save();
-        
-        res.status(200)
-            .json({
-                message: "Signup successfully",
-                success: true
-            })
-    } catch (err) {
+    try {} catch (err) {
         console.log(err);
         res.status(500)

[Timeout] StringLiteral
Controllers/AuthController.js:12:21
     try {
         const { name, email, password } = req.body;
         console.log(email);
-        console.log('bbb')
+        console.log("")
         const user = await UserModel.findOne({ email });
         if (user) {

[Timeout] ConditionalExpression
Controllers/AuthController.js:14:13
         console.log(email);
         console.log('bbb')
         const user = await UserModel.findOne({ email });
-        if (user) {
+        if (true) {
             return res.status(409)
                 .json({ message: 'User already exist, you can login', success: false });

[Timeout] ObjectLiteral
Controllers/AuthController.js:24:19
         await userModel.save();
         
         res.status(200)
-            .json({
-                message: "Signup successfully",
-                success: true
-            })
+            .json({})
     } catch (err) {
         console.log(err);

[Timeout] StringLiteral
Controllers/AuthController.js:25:26
         
         res.status(200)
             .json({
-                message: "Signup successfully",
+                message: "",
                 success: true
             })

[Timeout] ObjectLiteral
Controllers/AuthController.js:31:19
     } catch (err) {
         console.log(err);
         res.status(500)
-            .json({
-                message: err,
-                success: false
-            })
+            .json({})
     }
 }

[Timeout] StringLiteral
Controllers/AuthController.js:43:26
     try {
         const { email, password } = req.body;
         const user = await UserModel.findOne({ email });
-        const errorMsg = 'Auth failed email or password is wrong';
+        const errorMsg = "";
         if (!user) {
             return res.status(403)

[Timeout] ConditionalExpression
Controllers/AuthController.js:44:13
         const { email, password } = req.body;
         const user = await UserModel.findOne({ email });
         const errorMsg = 'Auth failed email or password is wrong';
-        if (!user) {
+        if (false) {
             return res.status(403)
                 .json({ message: errorMsg, success: false });

[Timeout] BlockStatement
Controllers/AuthController.js:44:20
         const { email, password } = req.body;
         const user = await UserModel.findOne({ email });
         const errorMsg = 'Auth failed email or password is wrong';
-        if (!user) {
-            return res.status(403)
-                .json({ message: errorMsg, success: false });
-        }
+        if (!user) {}
         const isPassEqual = await bcrypt.compare(password, user.password);
         if (!isPassEqual) {

[Timeout] BooleanLiteral
Controllers/AuthController.js:46:53
         const errorMsg = 'Auth failed email or password is wrong';
         if (!user) {
             return res.status(403)
-                .json({ message: errorMsg, success: false });
+                .json({ message: errorMsg, success: true });
         }
         const isPassEqual = await bcrypt.compare(password, user.password);

[Timeout] ConditionalExpression
Controllers/AuthController.js:49:13
                 .json({ message: errorMsg, success: false });
         }
         const isPassEqual = await bcrypt.compare(password, user.password);
-        if (!isPassEqual) {
+        if (true) {
             return res.status(403)
                 .json({ message: errorMsg, success: false });

[Timeout] BlockStatement
Controllers/AuthController.js:49:27
                 .json({ message: errorMsg, success: false });
         }
         const isPassEqual = await bcrypt.compare(password, user.password);
-        if (!isPassEqual) {
-            return res.status(403)
-                .json({ message: errorMsg, success: false });
-        }
+        if (!isPassEqual) {}
         const jwtToken = jwt.sign(
             { email: user.email, _id: user._id },

[Timeout] ObjectLiteral
Controllers/AuthController.js:51:23
         const isPassEqual = await bcrypt.compare(password, user.password);
         if (!isPassEqual) {
             return res.status(403)
-                .json({ message: errorMsg, success: false });
+                .json({});
         }
         const jwtToken = jwt.sign(

[Timeout] ObjectLiteral
Controllers/AuthController.js:54:13
                 .json({ message: errorMsg, success: false });
         }
         const jwtToken = jwt.sign(
-            { email: user.email, _id: user._id },
+            {},
             JWT_SECRET,
             { expiresIn: '24h' }

[Timeout] StringLiteral
Controllers/AuthController.js:56:26
         const jwtToken = jwt.sign(
             { email: user.email, _id: user._id },
             JWT_SECRET,
-            { expiresIn: '24h' }
+            { expiresIn: "" }
         )
 

[Timeout] ObjectLiteral
Controllers/AuthController.js:60:19
         )
 
         res.status(200)
-            .json({
-                message: "Login Success",
-                success: true,
-                jwtToken,
-                email,
-                name: user.name,
-                userId: user._id
-            })
+            .json({})
     } catch (err) {
         res.status(500)

[Timeout] BooleanLiteral
Controllers/AuthController.js:62:26
         res.status(200)
             .json({
                 message: "Login Success",
-                success: true,
+                success: false,
                 jwtToken,
                 email,

[Timeout] BlockStatement
Controllers/AuthController.js:68:19
                 name: user.name,
                 userId: user._id
             })
-    } catch (err) {
-        res.status(500)
-            .json({
-                message: "Internal server errror",
-                success: false
-            })
-    }
+    } catch (err) {}
 }

[Timeout] ObjectLiteral
Controllers/AuthController.js:70:19
             })
     } catch (err) {
         res.status(500)
-            .json({
-                message: "Internal server errror",
-                success: false
-            })
+            .json({})
     }
 }

[Timeout] BooleanLiteral
Controllers/AuthController.js:72:26
         res.status(500)
             .json({
                 message: "Internal server errror",
-                success: false
+                success: true
             })
     }
