[Timeout] BlockStatement
index.js:19:28
 app.use(express.json());
 app.use(bodyParser.json());
 
-app.get('/', (req, res) => {
-    res.status(200).send('OK');
-});
+app.get('/', (req, res) => {});
 
 app.use("/auth",AuthRouter);

[Timeout] BlockStatement
index.js:29:23
 app.use('/bookings', bookingRouter);
 app.use('/api', subscribeRouter);
 
-app.use((req, res) => {
-    res.status(404).json({ message: 'Not Found' });
-});
+app.use((req, res) => {});
 
 

[Timeout] StringLiteral
index.js:30:37
 app.use('/api', subscribeRouter);
 
 app.use((req, res) => {
-    res.status(404).json({ message: 'Not Found' });
+    res.status(404).json({ message: "" });
 });
 
