[Timeout] BlockStatement
Middlewares/AuthValidation.js:3:53
 import Joi from 'joi';
 
-export const signupValidation = (req, res, next) => {
-    const schema = Joi.object({
-        name: Joi.string().min(3).max(100).required(),
-        email: Joi.string().email().required(),
-        password: Joi.string().min(4).max(100).required()
-    });
-    const { error } = schema.validate(req.body);
-    
-    if (error) {
-        return res.status(400)
-            .json({ message: "Bad request", error })
-    }
-    next();
-}
+export const signupValidation = (req, res, next) => {}
 export const loginValidation = (req, res, next) => {
     const schema = Joi.object({

[Timeout] MethodExpression
Middlewares/AuthValidation.js:5:15
 
 export const signupValidation = (req, res, next) => {
     const schema = Joi.object({
-        name: Joi.string().min(3).max(100).required(),
+        name: Joi.string().min(3).min(100).required(),
         email: Joi.string().email().required(),
         password: Joi.string().min(4).max(100).required()

[Timeout] MethodExpression
Middlewares/AuthValidation.js:5:15
 
 export const signupValidation = (req, res, next) => {
     const schema = Joi.object({
-        name: Joi.string().min(3).max(100).required(),
+        name: Joi.string().max(3).max(100).required(),
         email: Joi.string().email().required(),
         password: Joi.string().min(4).max(100).required()

[Timeout] MethodExpression
Middlewares/AuthValidation.js:7:19
     const schema = Joi.object({
         name: Joi.string().min(3).max(100).required(),
         email: Joi.string().email().required(),
-        password: Joi.string().min(4).max(100).required()
+        password: Joi.string().min(4).min(100).required()
     });
     const { error } = schema.validate(req.body);

[Timeout] MethodExpression
Middlewares/AuthValidation.js:7:19
     const schema = Joi.object({
         name: Joi.string().min(3).max(100).required(),
         email: Joi.string().email().required(),
-        password: Joi.string().min(4).max(100).required()
+        password: Joi.string().max(4).max(100).required()
     });
     const { error } = schema.validate(req.body);

[Timeout] BlockStatement
Middlewares/AuthValidation.js:11:16
     });
     const { error } = schema.validate(req.body);
     
-    if (error) {
-        return res.status(400)
-            .json({ message: "Bad request", error })
-    }
+    if (error) {}
     next();
 }

[Timeout] ObjectLiteral
Middlewares/AuthValidation.js:13:19
     
     if (error) {
         return res.status(400)
-            .json({ message: "Bad request", error })
+            .json({})
     }
     next();

[Timeout] StringLiteral
Middlewares/AuthValidation.js:13:30
     
     if (error) {
         return res.status(400)
-            .json({ message: "Bad request", error })
+            .json({ message: "", error })
     }
     next();

[Timeout] BlockStatement
Middlewares/AuthValidation.js:17:52
     }
     next();
 }
-export const loginValidation = (req, res, next) => {
-    const schema = Joi.object({
-        email: Joi.string().email().required(),
-        password: Joi.string().min(4).max(100).required()
-    });
-    const { error } = schema.validate(req.body);
-    if (error) {
-        return res.status(400)
-            .json({ message: "Bad request", error })
-    }
-    next();
-}
+export const loginValidation = (req, res, next) => {}
 

[Timeout] BlockStatement
Middlewares/AuthValidation.js:23:16
         password: Joi.string().min(4).max(100).required()
     });
     const { error } = schema.validate(req.body);
-    if (error) {
-        return res.status(400)
-            .json({ message: "Bad request", error })
-    }
+    if (error) {}
     next();
 }

[Timeout] ConditionalExpression
Middlewares/AuthValidation.js:23:9
         password: Joi.string().min(4).max(100).required()
     });
     const { error } = schema.validate(req.body);
-    if (error) {
+    if (false) {
         return res.status(400)
             .json({ message: "Bad request", error })
