[Timeout] BlockStatement
Routes/BookingRouter.js:24:20
 
         // First verify if user exists
         const user = await UserModel.findById(userId);
-        if (!user) {
-            return res.status(404).json({ 
-                success: false, 
-                message: 'User not found' 
-            });
-        }
+        if (!user) {}
 
         // Verify flight exists and has available seats

[Timeout] BooleanLiteral
Routes/BookingRouter.js:24:13
 
         // First verify if user exists
         const user = await UserModel.findById(userId);
-        if (!user) {
+        if (user) {
             return res.status(404).json({ 
                 success: false, 

[Timeout] BooleanLiteral
Routes/BookingRouter.js:26:26
         const user = await UserModel.findById(userId);
         if (!user) {
             return res.status(404).json({ 
-                success: false, 
+                success: true, 
                 message: 'User not found' 
             });

[Timeout] BooleanLiteral
Routes/BookingRouter.js:33:13
 
         // Verify flight exists and has available seats
         const flight = await FlightModel.findById(flightId);
-        if (!flight) {
+        if (flight) {
             return res.status(404).json({ 
                 success: false, 

[Timeout] BlockStatement
Routes/BookingRouter.js:33:22
 
         // Verify flight exists and has available seats
         const flight = await FlightModel.findById(flightId);
-        if (!flight) {
-            return res.status(404).json({ 
-                success: false, 
-                message: 'Flight not found' 
-            });
-        }
+        if (!flight) {}
 
         if (flight.availableseats < passengers.length) {

[Timeout] StringLiteral
Routes/BookingRouter.js:36:26
         if (!flight) {
             return res.status(404).json({ 
                 success: false, 
-                message: 'Flight not found' 
+                message: "" 
             });
         }

[Timeout] BlockStatement
Routes/BookingRouter.js:40:56
             });
         }
 
-        if (flight.availableseats < passengers.length) {
-            return res.status(400).json({ 
-                success: false, 
-                message: 'Not enough seats available' 
-            });
-        }
+        if (flight.availableseats < passengers.length) {}
 
         // Create new booking using BookingModel

[Timeout] EqualityOperator
Routes/BookingRouter.js:40:13
             });
         }
 
-        if (flight.availableseats < passengers.length) {
+        if (flight.availableseats >= passengers.length) {
             return res.status(400).json({ 
                 success: false, 

[Timeout] StringLiteral
Routes/BookingRouter.js:43:26
         if (flight.availableseats < passengers.length) {
             return res.status(400).json({ 
                 success: false, 
-                message: 'Not enough seats available' 
+                message: "" 
             });
         }

[Timeout] AssignmentOperator
Routes/BookingRouter.js:71:9
         await user.save();
 
         // Update flight's available seats
-        flight.availableseats -= passengers.length;
+        flight.availableseats += passengers.length;
         await flight.save();
 

[Timeout] StringLiteral
Routes/BookingRouter.js:76:22
 
         res.status(201).json({
             success: true,
-            message: 'Booking created successfully',
+            message: "",
             booking: savedBooking
         });

[Timeout] BlockStatement
Routes/BookingRouter.js:80:21
             booking: savedBooking
         });
 
-    } catch (error) {
-        console.error('Booking creation error:', error);
-        res.status(500).json({
-            success: false,
-            message: 'Error creating booking',
-            error: error.message
-        });
-    }
+    } catch (error) {}
 });
 

[Timeout] StringLiteral
Routes/BookingRouter.js:81:23
         });
 
     } catch (error) {
-        console.error('Booking creation error:', error);
+        console.error("", error);
         res.status(500).json({
             success: false,
