[Timeout] BlockStatement
Routes/SearchRouter.js:8:43
 const router = express.Router();
 
 
-router.get('/flight', async (req, res) => {
-  try {
-    const { from, to, start_date } = req.query;
-
-    // Build the query object
-    const query = {};
-    if (from) query.from = from;
-    if (to) query.to = to;
-    if (start_date) query['flight date'] = new String(start_date);
-
-    const flights = await FlightModel.find(query);
-    if (flights.length === 0) {
-      return res.status(404).json({ message: "No flights found", success: false });
-    }
-    res.status(200).json({ flights, success: true });
-  } catch (err) {
-    console.error("Error fetching flights:", err);
-    res.status(500).json({ message: "Internal server error", success: false });
-  }
-});
+router.get('/flight', async (req, res) => {});
 
 

[Timeout] BlockStatement
Routes/SearchRouter.js:9:7
 
 
 router.get('/flight', async (req, res) => {
-  try {
-    const { from, to, start_date } = req.query;
-
-    // Build the query object
-    const query = {};
-    if (from) query.from = from;
-    if (to) query.to = to;
-    if (start_date) query['flight date'] = new String(start_date);
-
-    const flights = await FlightModel.find(query);
-    if (flights.length === 0) {
-      return res.status(404).json({ message: "No flights found", success: false });
-    }
-    res.status(200).json({ flights, success: true });
-  } catch (err) {
+  try {} catch (err) {
     console.error("Error fetching flights:", err);
     res.status(500).json({ message: "Internal server error", success: false });

[Timeout] ConditionalExpression
Routes/SearchRouter.js:14:9
 
     // Build the query object
     const query = {};
-    if (from) query.from = from;
+    if (true) query.from = from;
     if (to) query.to = to;
     if (start_date) query['flight date'] = new String(start_date);

[Timeout] ConditionalExpression
Routes/SearchRouter.js:14:9
 
     // Build the query object
     const query = {};
-    if (from) query.from = from;
+    if (false) query.from = from;
     if (to) query.to = to;
     if (start_date) query['flight date'] = new String(start_date);

[Timeout] ConditionalExpression
Routes/SearchRouter.js:15:9
     // Build the query object
     const query = {};
     if (from) query.from = from;
-    if (to) query.to = to;
+    if (false) query.to = to;
     if (start_date) query['flight date'] = new String(start_date);
 

[Timeout] ConditionalExpression
Routes/SearchRouter.js:15:9
     // Build the query object
     const query = {};
     if (from) query.from = from;
-    if (to) query.to = to;
+    if (true) query.to = to;
     if (start_date) query['flight date'] = new String(start_date);
 

[Timeout] ConditionalExpression
Routes/SearchRouter.js:16:9
     const query = {};
     if (from) query.from = from;
     if (to) query.to = to;
-    if (start_date) query['flight date'] = new String(start_date);
+    if (false) query['flight date'] = new String(start_date);
 
     const flights = await FlightModel.find(query);

[Timeout] ConditionalExpression
Routes/SearchRouter.js:16:9
     const query = {};
     if (from) query.from = from;
     if (to) query.to = to;
-    if (start_date) query['flight date'] = new String(start_date);
+    if (true) query['flight date'] = new String(start_date);
 
     const flights = await FlightModel.find(query);

[Timeout] EqualityOperator
Routes/SearchRouter.js:19:9
     if (start_date) query['flight date'] = new String(start_date);
 
     const flights = await FlightModel.find(query);
-    if (flights.length === 0) {
+    if (flights.length !== 0) {
       return res.status(404).json({ message: "No flights found", success: false });
     }

[Timeout] BlockStatement
Routes/SearchRouter.js:19:31
     if (start_date) query['flight date'] = new String(start_date);
 
     const flights = await FlightModel.find(query);
-    if (flights.length === 0) {
-      return res.status(404).json({ message: "No flights found", success: false });
-    }
+    if (flights.length === 0) {}
     res.status(200).json({ flights, success: true });
   } catch (err) {

[Timeout] BooleanLiteral
Routes/SearchRouter.js:20:75
 
     const flights = await FlightModel.find(query);
     if (flights.length === 0) {
-      return res.status(404).json({ message: "No flights found", success: false });
+      return res.status(404).json({ message: "No flights found", success: true });
     }
     res.status(200).json({ flights, success: true });

[Timeout] BooleanLiteral
Routes/SearchRouter.js:22:46
     if (flights.length === 0) {
       return res.status(404).json({ message: "No flights found", success: false });
     }
-    res.status(200).json({ flights, success: true });
+    res.status(200).json({ flights, success: false });
   } catch (err) {
     console.error("Error fetching flights:", err);

[Timeout] BlockStatement
Routes/SearchRouter.js:23:17
       return res.status(404).json({ message: "No flights found", success: false });
     }
     res.status(200).json({ flights, success: true });
-  } catch (err) {
-    console.error("Error fetching flights:", err);
-    res.status(500).json({ message: "Internal server error", success: false });
-  }
+  } catch (err) {}
 });
 

[Timeout] BooleanLiteral
Routes/SearchRouter.js:25:71
     res.status(200).json({ flights, success: true });
   } catch (err) {
     console.error("Error fetching flights:", err);
-    res.status(500).json({ message: "Internal server error", success: false });
+    res.status(500).json({ message: "Internal server error", success: true });
   }
 });
