[Killed] BooleanLiteral
Routes/Subscribe.js:15:7
 router.post('/subscribe', async (req, res) => {
   const { email } = req.body;
 
-  if (!email) {
+  if (email) {
     return res.status(400).json({ success: false, message: 'Email is required' });
   }
killedBy: POST /subscribe should return 400 if email is missing
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 400
Received: 500

[Timeout] ConditionalExpression
Routes/Subscribe.js:15:7
 router.post('/subscribe', async (req, res) => {
   const { email } = req.body;
 
-  if (!email) {
+  if (false) {
     return res.status(400).json({ success: false, message: 'Email is required' });
   }

[Timeout] BooleanLiteral
Routes/Subscribe.js:16:44
   const { email } = req.body;
 
   if (!email) {
-    return res.status(400).json({ success: false, message: 'Email is required' });
+    return res.status(400).json({ success: true, message: 'Email is required' });
   }
 

[Timeout] ObjectLiteral
Routes/Subscribe.js:16:33
   const { email } = req.body;
 
   if (!email) {
-    return res.status(400).json({ success: false, message: 'Email is required' });
+    return res.status(400).json({});
   }
 

[Timeout] ConditionalExpression
Routes/Subscribe.js:22:9
   try {
     // Check if email already exists
     const existingSubscriber = await SubscriberModel.findOne({ email });
-    if (existingSubscriber) {
+    if (false) {
       return res.status(400).json({
         success: false,

[Timeout] BlockStatement
Routes/Subscribe.js:22:29
   try {
     // Check if email already exists
     const existingSubscriber = await SubscriberModel.findOne({ email });
-    if (existingSubscriber) {
-      return res.status(400).json({
-        success: false,
-        message: 'Email already subscribed'
-      });
-    }
+    if (existingSubscriber) {}
     
     // Configure nodemailer transporter with more detailed settings

[Timeout] ObjectLiteral
Routes/Subscribe.js:30:52
     }
     
     // Configure nodemailer transporter with more detailed settings
-    const transporter = nodemailer.createTransport({
-     service: 'gmail',
-      
-      auth: {
-        user: process.env.EMAIL_USER,
-        pass: process.env.EMAIL_APP_PASSWORD
-      }
-    });
+    const transporter = nodemailer.createTransport({});
 
     // Email content

[Timeout] StringLiteral
Routes/Subscribe.js:44:13
       from: process.env.EMAIL_USER,
       to: email,
       subject: 'Welcome to SkyLynx Newsletter!',
-      html: `
-      <div style="font-family: Arial, sans-serif; max-width: 600px; margin: 0 auto;">
-      <h1 style="color: #003580;">Welcome to SkyLynx! ✈️</h1>
-      <p>Thank you for subscribing to our newsletter!</p>
-      <p>You'll now receive:</p>
-      <ul>
-      <li>Exclusive flight deals</li>
-      <li>Travel tips and guides</li>
-      <li>Special promotions</li>
-      <li>Latest travel updates</li>
-      </ul>
-      <p>Stay tuned for our next update!</p>
-      </div>
-      `
+      html: ``
     };
 

[Timeout] ObjectLiteral
Routes/Subscribe.js:61:47
     };
 
     // Save to database first
-    const newSubscriber = new SubscriberModel({ email });
+    const newSubscriber = new SubscriberModel({});
     await newSubscriber.save();
 

[Timeout] BooleanLiteral
Routes/Subscribe.js:68:16
     await transporter.sendMail(mailOptions);
 
     res.status(200).json({
-      success: true,
+      success: false,
       message: 'Successfully subscribed! Please check your email for confirmation.'
     });

[Timeout] BlockStatement
Routes/Subscribe.js:71:19
       success: true,
       message: 'Successfully subscribed! Please check your email for confirmation.'
     });
-  } catch (error) {
-    console.error('Subscription error:', error);
-    res.status(500).json({
-      success: false,
-      message: 'Failed to subscribe. Please try again later.'
-    });
-  }
+  } catch (error) {}
 });
 

[Timeout] StringLiteral
Routes/Subscribe.js:72:19
       message: 'Successfully subscribed! Please check your email for confirmation.'
     });
   } catch (error) {
-    console.error('Subscription error:', error);
+    console.error("", error);
     res.status(500).json({
       success: false,
