[Timeout] BlockStatement
Routes/UserRouter.js:11:43
 dotenv.config();
 const router = express.Router();
 router.use(cors());
-router.get('/user/:userId', (req, res) => {
-  UserModel.findOne({ _id: req.params.userId })
-      .then(user => {
-          if (!user) {
-              return res.status(404).json({ message: 'User not found' });
-          }
-          res.json(user);
-      })
-      .catch(err => {
-          res.status(500).json({ message: err.message });
-      });
-});
+router.get('/user/:userId', (req, res) => {});
 
 router.get('/user',(req,res)=>{

[Timeout] BlockStatement
Routes/UserRouter.js:13:21
 router.use(cors());
 router.get('/user/:userId', (req, res) => {
   UserModel.findOne({ _id: req.params.userId })
-      .then(user => {
-          if (!user) {
-              return res.status(404).json({ message: 'User not found' });
-          }
-          res.json(user);
-      })
+      .then(user => {})
       .catch(err => {
           res.status(500).json({ message: err.message });

[Timeout] ConditionalExpression
Routes/UserRouter.js:14:15
 router.get('/user/:userId', (req, res) => {
   UserModel.findOne({ _id: req.params.userId })
       .then(user => {
-          if (!user) {
+          if (true) {
               return res.status(404).json({ message: 'User not found' });
           }

[Timeout] BooleanLiteral
Routes/UserRouter.js:14:15
 router.get('/user/:userId', (req, res) => {
   UserModel.findOne({ _id: req.params.userId })
       .then(user => {
-          if (!user) {
+          if (user) {
               return res.status(404).json({ message: 'User not found' });
           }

[Timeout] BlockStatement
Routes/UserRouter.js:19:21
           }
           res.json(user);
       })
-      .catch(err => {
-          res.status(500).json({ message: err.message });
-      });
+      .catch(err => {});
 });
 

[Timeout] BlockStatement
Routes/UserRouter.js:24:31
       });
 });
 
-router.get('/user',(req,res)=>{
-  res.json({message:"user"})
-});
+router.get('/user',(req,res)=>{});
 
 // Update User Profile Data

[Timeout] StringLiteral
Routes/UserRouter.js:25:21
 });
 
 router.get('/user',(req,res)=>{
-  res.json({message:"user"})
+  res.json({message:""})
 });
 

[Timeout] BlockStatement
Routes/UserRouter.js:29:49
 });
 
 // Update User Profile Data
-router.put('/user/:userId', async (req, res) => {
-    try {
-        const user = await UserModel.findByIdAndUpdate(req.params.userId, req.body, { new: true });
-        if (!user) return res.status(404).json({ message: 'User not found' });
-        res.json(user);
-      } catch (err) {
-        res.status(500).json({ message: err.message });
-      }
-});
+router.put('/user/:userId', async (req, res) => {});
 
 //Update passengers data 

[Timeout] BlockStatement
Routes/UserRouter.js:30:9
 
 // Update User Profile Data
 router.put('/user/:userId', async (req, res) => {
-    try {
-        const user = await UserModel.findByIdAndUpdate(req.params.userId, req.body, { new: true });
-        if (!user) return res.status(404).json({ message: 'User not found' });
-        res.json(user);
-      } catch (err) {
+    try {} catch (err) {
         res.status(500).json({ message: err.message });
       }

[Timeout] BooleanLiteral
Routes/UserRouter.js:31:92
 // Update User Profile Data
 router.put('/user/:userId', async (req, res) => {
     try {
-        const user = await UserModel.findByIdAndUpdate(req.params.userId, req.body, { new: true });
+        const user = await UserModel.findByIdAndUpdate(req.params.userId, req.body, { new: false });
         if (!user) return res.status(404).json({ message: 'User not found' });
         res.json(user);

[Timeout] ConditionalExpression
Routes/UserRouter.js:32:13
 router.put('/user/:userId', async (req, res) => {
     try {
         const user = await UserModel.findByIdAndUpdate(req.params.userId, req.body, { new: true });
-        if (!user) return res.status(404).json({ message: 'User not found' });
+        if (true) return res.status(404).json({ message: 'User not found' });
         res.json(user);
       } catch (err) {

[Timeout] ConditionalExpression
Routes/UserRouter.js:32:13
 router.put('/user/:userId', async (req, res) => {
     try {
         const user = await UserModel.findByIdAndUpdate(req.params.userId, req.body, { new: true });
-        if (!user) return res.status(404).json({ message: 'User not found' });
+        if (false) return res.status(404).json({ message: 'User not found' });
         res.json(user);
       } catch (err) {

[Timeout] BlockStatement
Routes/UserRouter.js:34:21
         const user = await UserModel.findByIdAndUpdate(req.params.userId, req.body, { new: true });
         if (!user) return res.status(404).json({ message: 'User not found' });
         res.json(user);
-      } catch (err) {
-        res.status(500).json({ message: err.message });
-      }
+      } catch (err) {}
 });
 

[Timeout] ObjectLiteral
Routes/UserRouter.js:35:30
         if (!user) return res.status(404).json({ message: 'User not found' });
         res.json(user);
       } catch (err) {
-        res.status(500).json({ message: err.message });
+        res.status(500).json({});
       }
 });

[Timeout] BlockStatement
Routes/UserRouter.js:40:64
 });
 
 //Update passengers data 
-    router.put('/user/:userId/passengers', async (req, res) => {
-        const { userId } = req.params;
-  const { passengers } = req.body;
-
-  try {
-    // Update the passengers array for the user
-    const updatedUser = await UserModel.findByIdAndUpdate(
-      userId,
-      { passengers },
-      { new: true } 
-    );
-
-    if (!updatedUser) return res.status(404).json({ error: 'User not found' });
-
-    res.status(200).json(updatedUser);
-  } catch (error) {
-    console.error('Error updating passengers:', error);
-    res.status(500).json({ error: 'Internal Server Error' });
-  }
-});
+    router.put('/user/:userId/passengers', async (req, res) => {});
 
 

[Timeout] BlockStatement
Routes/UserRouter.js:44:7
         const { userId } = req.params;
   const { passengers } = req.body;
 
-  try {
-    // Update the passengers array for the user
-    const updatedUser = await UserModel.findByIdAndUpdate(
-      userId,
-      { passengers },
-      { new: true } 
-    );
-
-    if (!updatedUser) return res.status(404).json({ error: 'User not found' });
-
-    res.status(200).json(updatedUser);
-  } catch (error) {
+  try {} catch (error) {
     console.error('Error updating passengers:', error);
     res.status(500).json({ error: 'Internal Server Error' });

[Timeout] ObjectLiteral
Routes/UserRouter.js:48:7
     // Update the passengers array for the user
     const updatedUser = await UserModel.findByIdAndUpdate(
       userId,
-      { passengers },
+      {},
       { new: true } 
     );

[Timeout] BooleanLiteral
Routes/UserRouter.js:49:14
     const updatedUser = await UserModel.findByIdAndUpdate(
       userId,
       { passengers },
-      { new: true } 
+      { new: false } 
     );
 

[Timeout] ObjectLiteral
Routes/UserRouter.js:49:7
     const updatedUser = await UserModel.findByIdAndUpdate(
       userId,
       { passengers },
-      { new: true } 
+      {} 
     );
 

[Timeout] BooleanLiteral
Routes/UserRouter.js:52:9
       { new: true } 
     );
 
-    if (!updatedUser) return res.status(404).json({ error: 'User not found' });
+    if (updatedUser) return res.status(404).json({ error: 'User not found' });
 
     res.status(200).json(updatedUser);

[Timeout] ConditionalExpression
Routes/UserRouter.js:52:9
       { new: true } 
     );
 
-    if (!updatedUser) return res.status(404).json({ error: 'User not found' });
+    if (false) return res.status(404).json({ error: 'User not found' });
 
     res.status(200).json(updatedUser);

[Timeout] BlockStatement
Routes/UserRouter.js:55:19
     if (!updatedUser) return res.status(404).json({ error: 'User not found' });
 
     res.status(200).json(updatedUser);
-  } catch (error) {
-    console.error('Error updating passengers:', error);
-    res.status(500).json({ error: 'Internal Server Error' });
-  }
+  } catch (error) {}
 });
 

[Timeout] ConditionalExpression
Routes/UserRouter.js:67:9
     const { userId, passengerId } = req.params;
     
     // First validate the passenger ID format
-    if (!mongoose.Types.ObjectId.isValid(passengerId)) {
+    if (true) {
         return res.status(400).json({ message: 'Invalid passenger ID format' });
     }

[Timeout] BooleanLiteral
Routes/UserRouter.js:67:9
     const { userId, passengerId } = req.params;
     
     // First validate the passenger ID format
-    if (!mongoose.Types.ObjectId.isValid(passengerId)) {
+    if (mongoose.Types.ObjectId.isValid(passengerId)) {
         return res.status(400).json({ message: 'Invalid passenger ID format' });
     }

[Timeout] BlockStatement
Routes/UserRouter.js:71:9
         return res.status(400).json({ message: 'Invalid passenger ID format' });
     }
     
-    try {
-        // Find the user by ID and remove the passenger
-        const user = await UserModel.findById(userId);
-        if (!user) {
-            return res.status(404).json({ message: 'User not found' });
-        }
-    
-        // Check if passenger exists
-        const passengerIndex = user.passengers.findIndex(
-            (passenger) => passenger._id.toString() === passengerId
-        );
-        if (passengerIndex === -1) {
-            return res.status(404).json({ message: 'Passenger not found' });
-        }
-    
-        // Remove passenger from the array
-        user.passengers.splice(passengerIndex, 1);
-        await user.save();
-        
-        res.status(200).json({ message: 'Passenger deleted successfully' });
-    } catch (error) {
+    try {} catch (error) {
         console.error('Error deleting passenger:', error);
         res.status(500).json({ message: 'Server error', error: error.message });

[Timeout] ConditionalExpression
Routes/UserRouter.js:74:13
     try {
         // Find the user by ID and remove the passenger
         const user = await UserModel.findById(userId);
-        if (!user) {
+        if (false) {
             return res.status(404).json({ message: 'User not found' });
         }

[Timeout] ConditionalExpression
Routes/UserRouter.js:74:13
     try {
         // Find the user by ID and remove the passenger
         const user = await UserModel.findById(userId);
-        if (!user) {
+        if (true) {
             return res.status(404).json({ message: 'User not found' });
         }

[Timeout] StringLiteral
Routes/UserRouter.js:75:52
         // Find the user by ID and remove the passenger
         const user = await UserModel.findById(userId);
         if (!user) {
-            return res.status(404).json({ message: 'User not found' });
+            return res.status(404).json({ message: "" });
         }
     

[Timeout] ConditionalExpression
Routes/UserRouter.js:80:28
     
         // Check if passenger exists
         const passengerIndex = user.passengers.findIndex(
-            (passenger) => passenger._id.toString() === passengerId
+            (passenger) => true
         );
         if (passengerIndex === -1) {

[Timeout] EqualityOperator
Routes/UserRouter.js:80:28
     
         // Check if passenger exists
         const passengerIndex = user.passengers.findIndex(
-            (passenger) => passenger._id.toString() === passengerId
+            (passenger) => passenger._id.toString() !== passengerId
         );
         if (passengerIndex === -1) {

[Timeout] UnaryOperator
Routes/UserRouter.js:82:32
         const passengerIndex = user.passengers.findIndex(
             (passenger) => passenger._id.toString() === passengerId
         );
-        if (passengerIndex === -1) {
+        if (passengerIndex === +1) {
             return res.status(404).json({ message: 'Passenger not found' });
         }

[Timeout] EqualityOperator
Routes/UserRouter.js:82:13
         const passengerIndex = user.passengers.findIndex(
             (passenger) => passenger._id.toString() === passengerId
         );
-        if (passengerIndex === -1) {
+        if (passengerIndex !== -1) {
             return res.status(404).json({ message: 'Passenger not found' });
         }

[Timeout] StringLiteral
Routes/UserRouter.js:90:41
         user.passengers.splice(passengerIndex, 1);
         await user.save();
         
-        res.status(200).json({ message: 'Passenger deleted successfully' });
+        res.status(200).json({ message: "" });
     } catch (error) {
         console.error('Error deleting passenger:', error);

[Timeout] BlockStatement
Routes/UserRouter.js:91:21
         await user.save();
         
         res.status(200).json({ message: 'Passenger deleted successfully' });
-    } catch (error) {
-        console.error('Error deleting passenger:', error);
-        res.status(500).json({ message: 'Server error', error: error.message });
-    }
+    } catch (error) {}
 });
   

[Timeout] StringLiteral
Routes/UserRouter.js:92:23
         
         res.status(200).json({ message: 'Passenger deleted successfully' });
     } catch (error) {
-        console.error('Error deleting passenger:', error);
+        console.error("", error);
         res.status(500).json({ message: 'Server error', error: error.message });
     }

[Timeout] ObjectLiteral
Routes/UserRouter.js:93:30
         res.status(200).json({ message: 'Passenger deleted successfully' });
     } catch (error) {
         console.error('Error deleting passenger:', error);
-        res.status(500).json({ message: 'Server error', error: error.message });
+        res.status(500).json({});
     }
 });

[Timeout] BlockStatement
Routes/UserRouter.js:99:60
   
   
   // Route to get flight bookings for a specific user
-  router.get('/user/:userId/bookings', async (req, res) => {
-    try {
-      const { userId } = req.params;
-  
-      // Fetch the user data including bookings
-      const user = await UserModel.findById(userId).populate('bookings'); // Assuming bookings is a populated reference
-      // console.log(user);
-      if (!user) return res.status(404).json({ message: 'User not found' });
-      res.json(user.bookings); // Send only the bookings
-    } catch (error) {
-      console.error('Error fetching bookings:', error);
-      res.status(500).json({ message: 'Server error' });
-    }
-  });
+  router.get('/user/:userId/bookings', async (req, res) => {});
   
 export default router;

[Timeout] BlockStatement
Routes/UserRouter.js:100:9
   
   // Route to get flight bookings for a specific user
   router.get('/user/:userId/bookings', async (req, res) => {
-    try {
-      const { userId } = req.params;
-  
-      // Fetch the user data including bookings
-      const user = await UserModel.findById(userId).populate('bookings'); // Assuming bookings is a populated reference
-      // console.log(user);
-      if (!user) return res.status(404).json({ message: 'User not found' });
-      res.json(user.bookings); // Send only the bookings
-    } catch (error) {
+    try {} catch (error) {
       console.error('Error fetching bookings:', error);
       res.status(500).json({ message: 'Server error' });

[Timeout] BooleanLiteral
Routes/UserRouter.js:106:11
       // Fetch the user data including bookings
       const user = await UserModel.findById(userId).populate('bookings'); // Assuming bookings is a populated reference
       // console.log(user);
-      if (!user) return res.status(404).json({ message: 'User not found' });
+      if (user) return res.status(404).json({ message: 'User not found' });
       res.json(user.bookings); // Send only the bookings
     } catch (error) {

[Timeout] ConditionalExpression
Routes/UserRouter.js:106:11
       // Fetch the user data including bookings
       const user = await UserModel.findById(userId).populate('bookings'); // Assuming bookings is a populated reference
       // console.log(user);
-      if (!user) return res.status(404).json({ message: 'User not found' });
+      if (false) return res.status(404).json({ message: 'User not found' });
       res.json(user.bookings); // Send only the bookings
     } catch (error) {

[Timeout] BlockStatement
Routes/UserRouter.js:108:21
       // console.log(user);
       if (!user) return res.status(404).json({ message: 'User not found' });
       res.json(user.bookings); // Send only the bookings
-    } catch (error) {
-      console.error('Error fetching bookings:', error);
-      res.status(500).json({ message: 'Server error' });
-    }
+    } catch (error) {}
   });
   

[Timeout] ObjectLiteral
Routes/UserRouter.js:110:28
       res.json(user.bookings); // Send only the bookings
     } catch (error) {
       console.error('Error fetching bookings:', error);
-      res.status(500).json({ message: 'Server error' });
+      res.status(500).json({});
     }
   });
