[Killed] BlockStatement
Controllers/BookingController.js:9:9
 const JWT_SECRET = process.env.JWT_SECRET;
 
 export const Booking = async (req, res) => {
-    try {
-        const { name, email, password } = req.body;
-        console.log(email);
-        const user = await UserModel.findOne({ email });
-        if (user) {
-            return res.status(409)
-                .json({ message: 'User already exist, you can login', success: false });
-        }
-        const userModel = new UserModel({ name, email, password });
-        userModel.password = await bcrypt.hash(password, 10);
-       
-        await userModel.save();
-        
-        res.status(201)
-            .json({
-                message: "Signup successfully",
-                success: true
-            })
-    } catch (err) {
+    try {} catch (err) {
         console.log(err);
         res.status(500)
killedBy: Booking Controller - Booking function Booking (Signup) should return 409 if user already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409

Number of calls: 0

[Killed] BlockStatement
Controllers/BookingController.js:13:19
         const { name, email, password } = req.body;
         console.log(email);
         const user = await UserModel.findOne({ email });
-        if (user) {
-            return res.status(409)
-                .json({ message: 'User already exist, you can login', success: false });
-        }
+        if (user) {}
         const userModel = new UserModel({ name, email, password });
         userModel.password = await bcrypt.hash(password, 10);
killedBy: Booking Controller - Booking function Booking (Signup) should return 409 if user already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 500

Number of calls: 1

[Killed] ConditionalExpression
Controllers/BookingController.js:13:13
         const { name, email, password } = req.body;
         console.log(email);
         const user = await UserModel.findOne({ email });
-        if (user) {
+        if (false) {
             return res.status(409)
                 .json({ message: 'User already exist, you can login', success: false });
killedBy: Booking Controller - Booking function Booking (Signup) should return 409 if user already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 409
Received: 500

Number of calls: 1

[Killed] BooleanLiteral
Controllers/BookingController.js:15:80
         const user = await UserModel.findOne({ email });
         if (user) {
             return res.status(409)
-                .json({ message: 'User already exist, you can login', success: false });
+                .json({ message: 'User already exist, you can login', success: true });
         }
         const userModel = new UserModel({ name, email, password });
killedBy: Booking Controller - Booking function Booking (Signup) should return 409 if user already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "User already exist, you can login",
-   "success": false,

[Killed] ObjectLiteral
Controllers/BookingController.js:15:23
         const user = await UserModel.findOne({ email });
         if (user) {
             return res.status(409)
-                .json({ message: 'User already exist, you can login', success: false });
+                .json({});
         }
         const userModel = new UserModel({ name, email, password });
killedBy: Booking Controller - Booking function Booking (Signup) should return 409 if user already exists
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "message": "User already exist, you can login",
-   "success": false,

[Killed] ObjectLiteral
Controllers/BookingController.js:17:41
             return res.status(409)
                 .json({ message: 'User already exist, you can login', success: false });
         }
-        const userModel = new UserModel({ name, email, password });
+        const userModel = new UserModel({});
         userModel.password = await bcrypt.hash(password, 10);
        
killedBy: Booking Controller - Booking function Booking (Signup) should return 201 and create a new user
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BooleanLiteral
Controllers/BookingController.js:25:26
         res.status(201)
             .json({
                 message: "Signup successfully",
-                success: true
+                success: false
             })
     } catch (err) {
killedBy: Booking Controller - Booking function Booking (Signup) should return 201 and create a new user
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "message": "Signup successfully",
-   "success": true,

[Killed] BlockStatement
Controllers/BookingController.js:27:19
                 message: "Signup successfully",
                 success: true
             })
-    } catch (err) {
-        console.log(err);
-        res.status(500)
-            .json({
-                message: err,
-                success: false
-            })
-    }
+    } catch (err) {}
 }
killedBy: Booking Controller - Booking function Booking (Signup) should return 500 if an error occurs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: 500

Number of calls: 0

[Killed] BooleanLiteral
Controllers/BookingController.js:32:26
         res.status(500)
             .json({
                 message: err,
-                success: false
+                success: true
             })
     }
killedBy: Booking Controller - Booking function Booking (Signup) should return 500 if an error occurs
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "message": Any<Error>,
-   "success": false,
