[Killed] BlockStatement
server.js:3:24
 import app from './index.js'; // Assume your Express app instance is in app.js
 
-function startServer() {
-    const PORT = process.env.PORT;
-
-    if (!PORT) {
-        throw new Error("Invalid port");
-    }
-
-    app.listen(PORT, () => {
-        console.log(`Connected to Backend on port ${PORT}`);
-    });
-
-    return app; // Useful for testing
-}
+function startServer() {}
 startServer();
 export { startServer };
killedBy: Server Initialization Should throw an error if PORT is not defined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid port"

Received function did not throw

[Killed] ConditionalExpression
server.js:6:9
 function startServer() {
     const PORT = process.env.PORT;
 
-    if (!PORT) {
+    if (false) {
         throw new Error("Invalid port");
     }
killedBy: Server Initialization Should throw an error if PORT is not defined
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Invalid port"

Received function did not throw

[Killed] BlockStatement
server.js:10:28
         throw new Error("Invalid port");
     }
 
-    app.listen(PORT, () => {
-        console.log(`Connected to Backend on port ${PORT}`);
-    });
+    app.listen(PORT, () => {});
 
     return app; // Useful for testing
killedBy: Server Initialization Should start server successfully on a valid port
statusReason: Error: listen EADDRINUSE: address already in use :::5050
